#!/bin/bash
#---------------------------------------------------------------------------------------------------
#Напишете bash скрипт, който приема 1 аргумент от командния ред - съществуваща директория.
#Ако има повече/по-малко аргументи или няма такава директория: прекратете скрипта с код на изход 5.
#---------------------------------------------------------------------------------------------------

if [ $# -ne 1 ]
then
 echo "Incorrect input!";
 exit 5; 
elif [ ! -d $1 ]
then
 echo "The parameter is not dirrectory!";
 exit 5;
else

 cd $1 
 echo " Current directory $1! "  > stat.txt
 
#0)Създайте файл с име stat.txt в подадената директория, в който има:
#----------------------------------------------------------------------------------------------
#1)Среден размер на обикновен файл в директорията (= размера на вс файлове / бр на файловете).
#----------------------------------------------------------------------------------------------
 Sum=0; 
 for i in $(ls -l | tr -s " " | cut -f5 -d " " )
 do
  Sum=$(($Sum + $i))
 done

 AvarageSum=$(($Sum/$(ls | wc -l)))
 echo " AVARAGE:" $AverageSum  >> stat.txt
 
 echo " BIGGEST:" $(ls -S | head -n 1 )  >> stat.txt

#----------------------------------------------------------------------------------------------
#2)Кой е файлът с най-дълго име (под файл тук разбираме всичко, не само обикновени файлове, ами 
#и директории, линкове и т.н)
#----------------------------------------------------------------------------------------------
 biggestNameSize=0;
 name='';
 
 for i in $(ls)
 do
  current=$(echo $i | wc -c | cut -f1 -d" ")

  if [ $current -gt $biggestNameSize ]
  then
   name=$i
   biggestNameSize=$current;
  fi

 done
  echo "BIGGEST File Name: "  $name >> stat.txt  

#----------------------------------------------------------------------------------------------
  #3)Броя на символните линкове 
#----------------------------------------------------------------------------------------------
 NumberOfSymlinks=0;

 for i in $(ls)
 do

  if [ -L $i ]
  then
   NumberOfSymlinks=$(($NumberOfSymlinks + 1))
  fi
 done
 
#----------------------------------------------------------------------------------------------
#4)директорията с най-много файлове в нея и броят им (ако в директорията има други директории, 
#просто ги броим за едно, независимо колко файла има в тях)
#----------------------------------------------------------------------------------------------
 dir=''
 maximumNumberOfFiles=0;

 for i in $(ls)
 do
  if [ -d $i ]
  then
    currentNumber=$(ls $i| wc -l)

    if [ $currentNumber -gt $MaximumNumberOfFiles ] 
    then
     maximumNumberOfFiles=$currentNumber
     dir=$i;
    fi
  fi

 done

 echo "Dirrectory with maximum number of files" $dir >> stat.txt
 echo "And the number of files in it is: " $MaximumNumberOfFiles >> stat.txt

 echo "The number of symlinks is:" $NumberOfSymlinks  >> stat.txt 

#----------------------------------------------------------------------------------------------------
#5)Кой е потребителя, който изпълнява скрипта + всички файлове от директорията, на които е собственик
#----------------------------------------------------------------------------------------------------
 echo "USER: $USER"   >> stat.txt
 echo "$USER OWNS: "  >> stat.txt
 ls -l | tr -s " " | grep "$USER" | cut -f9 -d" " >> stat.txt
 chmod a-xw stat.txt
fi















